In [8]:
import pandas as pd
import numpy as np
pd.__version__

'1.4.1'

In [4]:
dict_data = {'CH':[100,200,300], 'CO':[400,500,600], 'MX':[700,800,900]}
dict_data

{'CH': [100, 200, 300], 'CO': [400, 500, 600], 'MX': [700, 800, 900]}

In [6]:
df = pd.DataFrame(dict_data)
df

    CH   CO   MX
0  100  400  700
1  200  500  800
2  300  600  900

In [11]:
dict_data2 = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
dict_data2

{'edad': [10, 9, 13, 14, 12, 11, 12],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9]}

In [14]:
df = pd.DataFrame(dict_data2, index= ['Ana','Benito','Camilo','Jerson','Gabriel', 'Veronica','Luisa'])
df

          edad   cm pais genero    Q1  Q2
Ana         10  115   co      M   5.0   7
Benito       9  110   mx      F  10.0   9
Camilo      13  130   co      F   8.0   9
Jerson      14  155   mx      M   NaN   8
Gabriel     12  125   mx      M   7.0   8
Veronica    11  120   ch      M   8.0   8
Luisa       12  125   ch      F   3.0   9

In [17]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [18]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [19]:
df['edad']

Ana         10
Benito       9
Camilo      13
Jerson      14
Gabriel     12
Veronica    11
Luisa       12
Name: edad, dtype: int64

In [20]:
df[['edad', 'cm', 'Q1']]

          edad   cm    Q1
Ana         10  115   5.0
Benito       9  110  10.0
Camilo      13  130   8.0
Jerson      14  155   NaN
Gabriel     12  125   7.0
Veronica    11  120   8.0
Luisa       12  125   3.0

In [23]:
df.loc[['Ana', 'Jerson'], ['edad', 'cm', 'Q1']]

        edad   cm   Q1
Ana       10  115  5.0
Jerson    14  155  NaN

In [24]:
df.iloc[2,1]

130

In [26]:
df.iloc[2:4,1:3]

         cm pais
Camilo  130   co
Jerson  155   mx

In [31]:
df[(df['edad']>=12) & (df['pais']=='mx')]

         edad   cm pais genero   Q1  Q2
Jerson     14  155   mx      M  NaN   8
Gabriel    12  125   mx      M  7.0   8